Revit 2027 API
RebarShape.GetCurvesForBrowser Method
 Generate curves for the shape, as used in the shape browser.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetCurvesForBrowser()
Public Function GetCurvesForBrowser As IList(Of Curve)
public:
IList<Curve^>^ GetCurvesForBrowser()
member GetCurvesForBrowser : unit -> IList<Curve>
Return Value
IList<Curve>
 An array of curves representing the shape with its default parameters.
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace